---
kind: type
id: T:Autodesk.Revit.DB.Macros.DocumentMacroOptions
source: html/718074d4-9235-9eb1-c8b1-e1d4bb9dddc6.htm
---
# Autodesk.Revit.DB.Macros.DocumentMacroOptions

The document macro options.

## Syntax (C#)
```csharp
public enum DocumentMacroOptions
```